InformationRegisters/Renault_ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код товара или карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_СертификатКонтроля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыгружатьВОборудование</Name>
					<Comment>Признак выгрузки ШК в торговое оборудование с памятью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код товара или карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Renault_ШтрихКодирование/Ext/Module.bsl
Процедура Renault_ШтрихКодированиеДокументов(Документ,Права=Неопределено) Экспорт
	//Проверим возможность штрих-кодирования документа
	Если обПраво("АвтоматическоеШтрихКодированиеДокументов",Права,,Документ) Тогда
		ОбъектыШК=Метаданные.РегистрыСведений.ШтрихКоды.Измерения.Объект.Тип;
		Если ОбъектыШК.СодержитТип(ТипЗнч(Документ.Ссылка)) Тогда
			//Документ может быть штрихкодирован
			ОбработкаОбъектШтрихКоды=Обработки.ШтрихКоды.Создать();
			ОбработкаОбъектШтрихКоды.Объект=Документ;
			ОбработкаОбъектШтрихКоды.ПрочитатьЗаполнитьШтрихКоды();
			Если ОбработкаОбъектШтрихКоды.Состав.Количество()>0 Тогда
				ШтрихКод=ОбработкаОбъектШтрихКоды.Состав[0].ШтрихКод;
			Иначе
				ШтрихКод="";
			КонецЕсли; 
			Если ПустаяСтрока(ШтрихКод) Тогда
				//Штрих-код не задан, создадим новый
				//+++ для заказ-наряда сформируем ШК по номеру документа
				Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказНаряд") Тогда
					ШтрихКод=Renault_СформироватьШтрихКодЗаказНаряда(Документ);
				Иначе	
				//---
					ШтрихКод=ОбработкаОбъектШтрихКоды.СформироватьШтрихКодТовара(Ложь);
				//+++
				КонецЕсли;
				//---
				Если ОбработкаОбъектШтрихКоды.Состав.Количество()=0 Тогда
					СтрокаШК=ОбработкаОбъектШтрихКоды.Состав.Добавить();
					СтрокаШК.Объект=Документ;
					СтрокаШК.Запрещен=Ложь;
				Иначе
					СтрокаШК=ОбработкаОбъектШтрихКоды.Состав[0];
				КонецЕсли; 
				СтрокаШК.ШтрихКод=ШтрихКод;
				//Запишем автоматически сформированный штрих-код
				Если НЕ ОбработкаОбъектШтрихКоды.ЗаписатьШтрихКоды() Тогда
					//Произошла ошибка
					ТекстОшибки = "Ошибка записи штрих-кода документа.";
					Сообщить(ТекстОшибки);
					ВызватьИсключение ТекстОшибки;
				Иначе
					Сообщить("Документу <"+Документ+"> присвоен штрих-код """+ШтрихКод+"""",СтатусСообщения.Информация);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры // дкШтрихКодированиеДокументов()

Функция Renault_СформироватьШтрихКодЗаказНаряда(ДокументОбъект) Экспорт
	
	Возврат "90" + Формат(Число(Прав(ДокументОбъект.Номер, СтрДлина(ДокументОбъект.Номер)-5)), "ЧЦ=10; ЧВН=; ЧГ=0")+ "0"; 

КонецФункции

Процедура Renault_ШтрихКодированиеДокументовЗаявка(Документ,Права=Неопределено) Экспорт
	//Проверим возможность штрих-кодирования документа
	//Если обПраво("АвтоматическоеШтрихКодированиеДокументов",Права,,Документ) Тогда
		ОбъектыШК=Метаданные.РегистрыСведений.Renault_ШтрихКоды.Измерения.Объект.Тип;
		Если ОбъектыШК.СодержитТип(ТипЗнч(Документ.Ссылка)) Тогда
			//Документ может быть штрихкодирован
			ОбработкаОбъектШтрихКоды=Обработки.Renault_ШтрихКоды.Создать();
			ОбработкаОбъектШтрихКоды.Объект=Документ;
			ОбработкаОбъектШтрихКоды.ПрочитатьЗаполнитьШтрихКоды();
			Если ОбработкаОбъектШтрихКоды.Состав.Количество()>0 Тогда
				ШтрихКод=ОбработкаОбъектШтрихКоды.Состав[0].ШтрихКод;
			Иначе
				ШтрихКод="";
			КонецЕсли; 
			Если ПустаяСтрока(ШтрихКод) Тогда
				//Штрих-код не задан, создадим новый
				//+++ для заказ-наряда сформируем ШК по номеру документа
				Если ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") Тогда
					ШтрихКод=Renault_СформироватьШтрихКодЗаказНаряда(Документ);
				Иначе	
				//---
					ШтрихКод=ОбработкаОбъектШтрихКоды.СформироватьШтрихКодТовара(Ложь);
				//+++
				КонецЕсли;
				//---
				Если ОбработкаОбъектШтрихКоды.Состав.Количество()=0 Тогда
					СтрокаШК=ОбработкаОбъектШтрихКоды.Состав.Добавить();
					СтрокаШК.Объект=Документ;
					СтрокаШК.Запрещен=Ложь;
				Иначе
					СтрокаШК=ОбработкаОбъектШтрихКоды.Состав[0];
				КонецЕсли; 
				СтрокаШК.ШтрихКод=ШтрихКод;
				//Запишем автоматически сформированный штрих-код
				Если НЕ ОбработкаОбъектШтрихКоды.ЗаписатьШтрихКоды() Тогда
					//Произошла ошибка
					ТекстОшибки = "Ошибка записи штрих-кода документа.";
					Сообщить(ТекстОшибки);
					ВызватьИсключение ТекстОшибки;
				Иначе
					Сообщить("Документу <"+Документ+"> присвоен штрих-код """+ШтрихКод+"""",СтатусСообщения.Информация);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	//КонецЕсли; 
КонецПроцедуры // дкШтрихКодированиеДокументов()

функция Renault_ПрочитатьШтрихКод(Документ) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") Тогда
		
		//Вывод штрихкода
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Renault_ШтрихКоды.ШтрихКод,
		               |	Renault_ШтрихКоды.Объект,
		               |	Renault_ШтрихКоды.ЕдиницаИзмерения,
		               |	Renault_ШтрихКоды.ХарактеристикаНоменклатуры,
		               |	Renault_ШтрихКоды.Запрет
		               |ИЗ
		               |	РегистрСведений.Renault_ШтрихКоды КАК Renault_ШтрихКоды
		               |ГДЕ
		               |	Renault_ШтрихКоды.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Документ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда		
			Возврат (Выборка.ШтрихКод);
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	Иначе
		
		//Вывод штрихкода
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ШтрихКоды.ШтрихКод,
		               |	ШтрихКоды.Объект,
		               |	ШтрихКоды.ЕдиницаИзмерения,
		               |	ШтрихКоды.ХарактеристикаНоменклатуры,
		               |	ШтрихКоды.Запрет
		               |ИЗ
		               |	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		               |ГДЕ
		               |	ШтрихКоды.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Документ);
		
		Попытка
		
			Выборка = Запрос.Выполнить().Выбрать();
		
		
		Исключение
		
			Возврат Неопределено;
			
		КонецПопытки;
		
		Если Выборка.Следующий() Тогда		
			Возврат (Выборка.ШтрихКод);
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецФункции

Процедура Renault_ЗаписатьШтрихКод(Документ) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") Тогда
		
		Renault_ШтрихКодированиеДокументовЗаявка(Документ);
		
	Иначе
		
		Renault_ШтрихКодированиеДокументов(Документ);		
		
	КонецЕсли;
	
	
КонецПроцедуры
